app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "david"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(name: params[:session][:name].downcase)