app/controllers/squares_controller.rb

SELECT  1 AS one FROM "user_squares" WHERE "user_squares"."userId" = ? LIMIT ?  [["userId", 1], ["LIMIT", 1]]
SELECT "squares".* FROM "squares" WHERE "squares"."id" IN (SELECT "user_squares"."squareId" FROM "user_squares" WHERE "user_squares"."userId" = ?)  [["userId", 3]]
SELECT  "squares".* FROM "squares" WHERE "squares"."defaultStatus" = ? LIMIT ?  [["defaultStatus", "true"], ["LIMIT", 1]]
SELECT "squares".* FROM "squares"
INSERT INTO "user_squares" ("name", "description", "color", "defaultStatus", "link", "userId", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "squares".* FROM "squares" WHERE "squares"."id" IN (SELECT "user_squares"."" FROM "user_squares" WHERE "user_squares"."select" = ? AND "user_squares"."userId" = ?)  [["select", "squareId"], ["userId", 3]]
---
  def list

    @id = session[:user_id]

    if UserSquare.where(userId: @id).empty?
      #display all from Square
      @squares = Square.where(defaultStatus: 't')

      #copy all with userId to UserSquare
      @copySquares = Square.where(defaultStatus: 't')
      puts @copySquares
      @copySquares.each do |cs|
        UserSquare.create(userId: @id, squareId: cs.id)
      end

    end

    @ids = UserSquare.select("squareId").where(userId: @id)
    @squares = Square.where(id: @ids)